using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace VarsWebApi.Models
{
    public enum HorsePower
    {
        /// <summary>
        /// วัต50-100 แรงม้า0.05 - 0.1
        /// </summary>
        W50_100H005_01 = 1,
        /// <summary>
        /// วัต100-200 แรงม้า0.1 - 0.2
        /// </summary>
        W100_200H01_02 = 2,
        /// <summary>
        /// วัต101-200 แรงม้า0.1 - 0.2
        /// </summary>
        W101_200H01_02 = 3,
        /// <summary>
        /// วัต101-200 แรงม้า0.1 - 0.3
        /// </summary>
        W101_200H01_03 = 4,
        /// <summary>
        /// วัต200-300 แรงม้า0.2 - 0.4
        /// </summary>
        W200_300H02_04 = 5,
        /// <summary>
        /// วัต201-300 แรงม้า0.2 - 0.4
        /// </summary>
        W201_300H02_04 = 6,
        /// <summary>
        /// วัต201-300 แรงม้า0.3 - 0.4
        /// </summary>
        W201_300H03_04 = 7,
        /// <summary>
        /// วัต200-400 แรงม้า0.2 - 0.5
        /// </summary>
        W200_400H02_05 = 8,
        /// <summary>
        /// วัต200-500 แรงม้า0.2 - 0.7
        /// </summary>
        W200_500H02_07 = 9,
        /// <summary>
        /// วัต301-400 แรงม้า0.4 - 0.5
        /// </summary>
        W301_400H04_05 = 10,
        /// <summary>
        /// วัต301-400 แรงม้า0.4 - 0.6
        /// </summary>
        W301_400H04_06 = 11,
        /// <summary>
        /// วัต301-500 แรงม้า0.4 - 0.7
        /// </summary>
        W301_500H04_07 = 12,
        /// <summary>
        /// วัต401-500 แรงม้า0.5 - 0.7
        /// </summary>
        W401_500H05_07 = 13,
        /// <summary>
        /// วัต401-500 แรงม้า0.6 - 0.7
        /// </summary>
        W401_500H06_07 = 14,
        /// <summary>
        /// วัต401-600 แรงม้า0.5 - 1
        /// </summary>
        W401_600H05_1 = 15,
        /// <summary>
        /// วัต501-700 แรงม้า0.7 - 0.9
        /// </summary>
        W501_700H07_09 = 16,
        /// <summary>
        /// วัต501-700 แรงม้า0.7 - 1
        /// </summary>
        W501_700H07_1 = 17,
        /// <summary>
        /// วัต501-1000 แรงม้า0.7 - 1.5
        /// </summary>
        W501_1000H07_15 = 18,
        /// <summary>
        /// วัต601-1000 แรงม้า1-1.5
        /// </summary>
        W601_1000H1_15 = 19,
        /// <summary>
        /// วัต701-800 แรงม้า0.9 - 1
        /// </summary>
        W701_800H09_1 = 20,
        /// <summary>
        /// วัต701-1000 แรงม้า1 - 1.5
        /// </summary>
        W701_1000H1_15 = 21,
        /// <summary>
        /// วัต>800 แรงม้า>1
        /// </summary>
        W_800H_1 = 22,
        /// <summary>
        /// วัต1001-1200 แรงม้า1.5 - 1.7
        /// </summary>
        W1001_1200H15_17 = 23,
        /// <summary>
        /// วัต1001-1400 แรงม้า1.5 - 2
        /// </summary>
        W1001_1400H15_2 = 24,
        /// <summary>
        /// วัต1100 แรงม้า1.5
        /// </summary>
        W1100H15 = 25,
        /// <summary>
        /// วัต1201-1400 แรงม้า1.7 - 2
        /// </summary>
        W1201_1400H17_2 = 26,
        /// <summary>
        /// วัต1401-2000 แรงม้า2 - 2.5
        /// </summary>
        W1401_2000H2_25 = 27,
        /// <summary>
        /// วัต1000-2500 แรงม้า1 - 3
        /// </summary>
        W1000_2500H1_3 = 28,
        /// <summary>
        /// วัต1000-4000 แรงม้า1 - 5
        /// </summary>
        W1000_4000H1_5 = 29,
        /// <summary>
        /// วัต1500 แรงม้า2
        /// </summary>
        W1500H2 = 30,
        /// <summary>
        /// วัต2000-4000 แรงม้า2 - 5
        /// </summary>
        W2000_4000H2_5 = 31,
        /// <summary>
        /// วัต2000-4000 แรงม้า2.5 - 5.5
        /// </summary>
        W2000_4000H22_55 = 32,
        /// <summary>
        /// วัต2001-2500 แรงม้า2.5 - 3.5
        /// </summary>
        W2001_2500H25_35 = 33,
        /// <summary>
        /// วัต2001-3000 แรงม้า2.5 - 4
        /// </summary>
        W2001_3000H25_4 = 34,
        /// <summary>
        /// วัต2001-2500 แรงม้า3 - 3.5
        /// </summary>
        W2001_2500H3_35 = 35,
        /// <summary>
        /// วัต2501-3500 แรงม้า3 - 4.5
        /// </summary>
        W2501_3500H3_45 = 36,
        /// <summary>
        /// วัต2501-3500 แรงม้า3 - 5
        /// </summary>
        W2501_3500H3_5 = 37,
        /// <summary>
        /// วัต2501-3500 แรงม้า3.5 - 4.5
        /// </summary>
        W2501_3500H35_45 = 38,
        /// <summary>
        /// วัต2501-3500 แรงม้า3.5 - 5
        /// </summary>
        W2501_3500H35_5 = 39,
        /// <summary>
        /// วัต3001-5000 แรงม้า4 -7
        /// </summary>
        W3001_5000H4_7 = 40,
        /// <summary>
        /// วัต3501-4500 แรงม้า4.5 -6
        /// </summary>
        W3501_4500H45_6 = 41,
        /// <summary>
        /// วัต3501-4000 แรงม้า5 -5.5
        /// </summary>
        W3501_4000H5_55 = 42,
        /// <summary>
        /// วัต3501-4500 แรงม้า5 -6
        /// </summary>
        W3501_4500H5_6 = 43,
        /// <summary>
        /// วัต < 4000 แรงม้า < 5
        /// </summary>
        W4000_H5_ = 44,
        /// <summary>
        /// วัต4001-4500 แรงม้า5.5 - 6
        /// </summary>
        W4001_4500H55_6 = 45,
        /// <summary>
        /// วัต4001-5000 แรงม้า5 - 7
        /// </summary>
        W4001_5000H5_7 = 46,
        /// <summary>
        /// วัต4501-5000 แรงม้า6 - 6.5
        /// </summary>
        W4501_5000H6_65 = 47,
        /// <summary>
        /// วัต4501-5000 แรงม้า6 - 7
        /// </summary>
        W4501_5000H6_7 = 48,
        /// <summary>
        /// วัต4501-5500 แรงม้า6 - 7.5
        /// </summary>
        W4501_5500H6_75 = 49,
        /// <summary>
        /// วัต < 5000 แรงม้า < 7
        /// </summary>
        W_5000H_7 = 50,
        /// <summary>
        /// วัต4501-6000 แรงม้า6 - 8
        /// </summary>
        W4501_6000H6_8 = 51,
        /// <summary>
        /// วัต5000-12000 แรงม้า6.5 - 16
        /// </summary>
        W5000_12000H65_16 = 52,
        /// <summary>
        /// วัต5001-6000 แรงม้า6.5 - 8
        /// </summary>
        W5001_6000H65_8 = 53,
        /// <summary>
        /// วัต5001-6000 แรงม้า7 - 8
        /// </summary>
        W5001_6000H7_8 = 54,
        /// <summary>
        /// วัต5001-7000 แรงม้า7 - 9
        /// </summary>
        W5001_7000H7_9 = 55,
        /// <summary>
        /// วัต5001-7000 แรงม้า7 - 9.5
        /// </summary>
        W5001_7000H7_95 = 56,
        /// <summary>
        /// วัต < 5500 แรงม้า < 7
        /// </summary>
        W5500_H7_ = 57,
        /// <summary>
        /// วัต5500-6000 แรงม้า7 - 8
        /// </summary>
        W5500_6000H7_8 = 58,
        /// <summary>
        /// วัต5501-7500 แรงม้า7.5 - 10
        /// </summary>
        W5501_7500H7_8 = 59,
        /// <summary>
        /// วัต6001-6500 แรงม้า8 - 9
        /// </summary>
        W6001_6500H8_9 = 60,
        /// <summary>
        /// วัต6001-7000 แรงม้า8 - 9
        /// </summary>
        W6001_7000H8_9 = 61,
        /// <summary>
        /// วัต6001-7000 แรงม้า8 - 9.5
        /// </summary>
        W6001_7000H8_95 = 62,
        /// <summary>
        /// วัต6001-7500 แรงม้า8 - 10
        /// </summary>
        W6001_7500H8_10 = 63,
        /// <summary>
        /// วัต6001-8000 แรงม้า8 - 11
        /// </summary>
        W6001_800H8_11 = 64,
        /// <summary>
        /// วัต6501-7000 แรงม้า9 - 9.5
        /// </summary>
        W6501_7000H9_95 = 65,
        /// <summary>
        /// วัต>7000 แรงม้า>9
        /// </summary>
        W_7000H_9 = 66,
        /// <summary>
        /// วัต>7000 แรงม้า>9.5
        /// </summary>
        W_7000H_95 = 67,
        /// <summary>
        /// วัต>7500 แรงม้า>10
        /// </summary>
        W_7500H_10 = 68,
        /// <summary>
        /// วัต7001-7500 แรงม้า9.5 - 10
        /// </summary>
        W7001_7500H95_10 = 69,
        /// <summary>
        /// วัต7001-8000 แรงม้า8 - 9.5
        /// </summary>
        W7001_8000H8_95 = 70,
        /// <summary>
        /// วัต7001-8000 แรงม้า9.5 - 10.5
        /// </summary>
        W7001_8000H95_105 = 71,
        /// <summary>
        /// วัต7001-8000 แรงม้า9 - 11
        /// </summary>
        W7001_8000H9_11 = 72,
        /// <summary>
        /// วัต7001-8000 แรงม้า9.5 - 11
        /// </summary>
        W7001_8000H95_11 = 73,
        /// <summary>
        /// วัต7001-10000 แรงม้า9 - 15
        /// </summary>
        W7001_10000H9_15 = 74,
        /// <summary>
        /// วัต7501-8000 แรงม้า10 - 10.5
        /// </summary>
        W7501_8000H10_105 = 75,
        /// <summary>
        /// วัต7501-10000 แรงม้า10 - 15
        /// </summary>
        W7501_10000H10_15 = 76,
        /// <summary>
        /// วัต8001-8500 แรงม้า10.5 - 11
        /// </summary>
        W8001_8500H105_11 = 77,
        /// <summary>
        /// วัต8001-8500 แรงม้า11 - 11.5
        /// </summary>
        W8001_8500H11_115 = 78,
        /// <summary>
        /// วัต8001-9000 แรงม้า11 - 12
        /// </summary>
        W8001_9000H11_12 = 79,
        /// <summary>
        /// วัต8001-10000 แรงม้า10.5 - 13
        /// </summary>
        W8001_10000H105_13 = 80,
        /// <summary>
        /// วัต8001-10000 แรงม้า11 - 15
        /// </summary>
        W8001_10000H11_15 = 81,
        /// <summary>
        /// วัต8501-9000 แรงม้า11 - 12
        /// </summary>
        W8501_9000H11_12 = 82,
        /// <summary>
        /// วัต8501-9000 แรงม้า11.5 - 12
        /// </summary>
        W8501_9000H115_12 = 83,
        /// <summary>
        /// วัต9001-9500 แรงม้า12 - 13
        /// </summary>
        W9001_9500H12_13 = 84,
        /// <summary>
        /// วัต9001-10000 แรงม้า12 - 14
        /// </summary>
        W9001_10000H12_14 = 85,
        /// <summary>
        /// วัต9001-11000 แรงม้า12 - 15
        /// </summary>
        W9001_11000H12_15 = 86,
        /// <summary>
        /// วัต9501-10500 แรงม้า13 - 14
        /// </summary>
        W9501_10500H13_14 = 87,
        /// <summary>
        /// วัต9501-11000 แรงม้า13 - 15
        /// </summary>
        W9501_11000H13_15 = 88,
        /// <summary>
        /// วัต>10000 แรงม้า>13
        /// </summary>
        W_10000H_13 = 89,
        /// <summary>
        /// วัต10501-11500 แรงม้า14 - 15
        /// </summary>
        W10501_11500H14_15 = 90,
        /// <summary>
        /// วัต10001-12000 แรงม้า14 - 16
        /// </summary>
        W10001_12000H14_16 = 91,
        /// <summary>
        /// วัต11001-12000 แรงม้า15 - 16
        /// </summary>
        W11001_12000H15_16 = 92,
        /// <summary>
        /// วัต11001-13500 แรงม้า15 - 18
        /// </summary>
        W11001_13500H15_18 = 93,
        /// <summary>
        /// วัต10001-14000 แรงม้า15 - 20
        /// </summary>
        W10001_14000H15_20 = 94,
        /// <summary>
        /// วัต10001-14000 แรงม้า15 - 25
        /// </summary>
        W10001_14000H15_25 = 95,
        /// <summary>
        /// วัต10001-15000 แรงม้า15 - 20
        /// </summary>
        W10001_15000H15_20 = 96,
        /// <summary>
        /// วัต>11500 แรงม้า>15
        /// </summary>
        W_11500H_15 = 97,
        /// <summary>
        /// วัต>12000 แรงม้า>16
        /// </summary>
        W_12000H_16 = 98,
        /// <summary>
        /// วัต12001-15000 แรงม้า16 - 20
        /// </summary>
        W12001_15000H16_20 = 99,
        /// <summary>
        /// วัต14001-17000 แรงม้า20 - 23
        /// </summary>
        W14001_17000H20_23 = 100,
        /// <summary>
        /// วัต14000-18000 แรงม้า19 - 24
        /// </summary>
        W14000_18000H19_24 = 101,
        /// <summary>
        /// วัต15001-20000 แรงม้า20 - 25
        /// </summary>
        W15001_20000H20_25 = 102,
        /// <summary>
        /// วัต17001-20000 แรงม้า23 - 25
        /// </summary>
        W17001_20000H23_25 = 103,
        /// <summary>
        /// วัต > 18000 แรงม้า > 24
        /// </summary>
        W_18000H_24 = 104,
        /// <summary>
        /// วัต20001-25000 แรงม้า25 - 35
        /// </summary>
        W20001_25000H25_35 = 105,
        /// <summary>
        /// วัต20001-30000 แรงม้า25 - 40
        /// </summary>
        W20001_30000H25_40 = 106,
        /// <summary>
        /// วัต25001-30000 แรงม้า35 - 40
        /// </summary>
        W25001_30000H35_40 = 107,
        /// <summary>
        /// วัต30001-40000 แรงม้า40 - 55
        /// </summary>
        W30001_40000H40_55 = 108,
        /// <summary>
        /// วัต35001-40000 แรงม้า47 - 55
        /// </summary>
        W35001_40000H47_55 = 109,
        /// <summary>
        /// วัต>40000 แรงม้า>55
        /// </summary>
        W_40000H_55 = 110,
        /// <summary>
        /// วัต40001-50000 แรงม้า55 - 70
        /// </summary>
        W40001_50000H55_70 = 111,
        /// <summary>
        /// วัต50000-100000 แรงม้า65 - 135
        /// </summary>
        W50000_100000H65_135 = 112,
        /// <summary>
        /// วัต50001-60000 แรงม้า70 - 80
        /// </summary>
        W50001_60000H70_80 = 113,
        /// <summary>
        /// วัต60001-80000 แรงม้า80 - 105
        /// </summary>
        W60001_80000H80_105 = 114,
        /// <summary>
        /// วัต80001-110000 แรงม้า105 - 150
        /// </summary>
        W80001_110000H105_150 = 115,
        /// <summary>
        /// วัต>100000 แรงม้า>135
        /// </summary>
        W_100000H_135 = 116,
        /// <summary>
        /// วัต>110000 แรงม้า>150
        /// </summary>
        W_110000H_150 = 117,
        /// <summary>
        /// วัต30001-35000 แรงม้า40-47
        /// </summary>
        W30001_35000H40_47 = 118,
        /// <summary>
        /// วัต 2001-2500 แรงม้า 2.5 - 3
        /// </summary>
        W2001_2500H25_3 = 119,
        /// <summary>
        /// วัต1401-2000 แรงม้า2 - 3
        /// </summary>
        W1401_2000H2_3 = 120,
    }
}